import { Injectable } from "@angular/core";
import { Sport } from "src/app/classes/sport/sport";

@Injectable({
  providedIn: "root"
})
export class SportService {
  constructor() {}

  getSports(): Array<Sport> {
    let sports: Array<Sport> = [];
    sports.push(
      new Sport(
        "Академическая гребля",
        "Академическая гребля — циклический вид спорта. Спортсмены находятся в лодках и гребут вёслами, используя мышцы спины, рук и ног, проходя дистанцию спиной вперёд, в отличие от гребли на байдарках и каноэ. Наиболее распространена и популярна в странах Западной Европы, России, США, Австралии, Новой Зеландии и Румынии." +
          " Файл:ROWING Women's Single Sculls Final - 28th Summer Universiade 2015 Gwangju.webm" +
          " Академическая гребля включена в программу Олимпийских игр c 1896 года (у женщин с 1976 года). Кроме Олимпийских игр ежегодно проводится Чемпионат мира, Кубок мира, Кубок Наций, Чемпионат мира среди студентов, Чемпионат мира среди юношей.",
        "assets/images/rowing.PNG",
        "",
        0
      )
    );
    sports.push(
      new Sport(
        "Академическая гребля",
        "Академическая гребля — циклический вид спорта. Спортсмены находятся в лодках и гребут вёслами, используя мышцы спины, рук и ног, проходя дистанцию спиной вперёд, в отличие от гребли на байдарках и каноэ. Наиболее распространена и популярна в странах Западной Европы, России, США, Австралии, Новой Зеландии и Румынии." +
          " Файл:ROWING Women's Single Sculls Final - 28th Summer Universiade 2015 Gwangju.webm" +
          " Академическая гребля включена в программу Олимпийских игр c 1896 года (у женщин с 1976 года). Кроме Олимпийских игр ежегодно проводится Чемпионат мира, Кубок мира, Кубок Наций, Чемпионат мира среди студентов, Чемпионат мира среди юношей.",
        "assets/images/rowing.PNG",
        "",
        0
      )
    );
    sports.push(
      new Sport(
        "Академическая гребля",
        "Академическая гребля — циклический вид спорта. Спортсмены находятся в лодках и гребут вёслами, используя мышцы спины, рук и ног, проходя дистанцию спиной вперёд, в отличие от гребли на байдарках и каноэ. Наиболее распространена и популярна в странах Западной Европы, России, США, Австралии, Новой Зеландии и Румынии." +
          " Файл:ROWING Women's Single Sculls Final - 28th Summer Universiade 2015 Gwangju.webm" +
          " Академическая гребля включена в программу Олимпийских игр c 1896 года (у женщин с 1976 года). Кроме Олимпийских игр ежегодно проводится Чемпионат мира, Кубок мира, Кубок Наций, Чемпионат мира среди студентов, Чемпионат мира среди юношей.",
        "assets/images/rowing.PNG",
        "",
        0
      )
    );
    sports.push(
      new Sport(
        "Академическая гребля",
        "Академическая гребля — циклический вид спорта. Спортсмены находятся в лодках и гребут вёслами, используя мышцы спины, рук и ног, проходя дистанцию спиной вперёд, в отличие от гребли на байдарках и каноэ. Наиболее распространена и популярна в странах Западной Европы, России, США, Австралии, Новой Зеландии и Румынии." +
          " Файл:ROWING Women's Single Sculls Final - 28th Summer Universiade 2015 Gwangju.webm" +
          " Академическая гребля включена в программу Олимпийских игр c 1896 года (у женщин с 1976 года). Кроме Олимпийских игр ежегодно проводится Чемпионат мира, Кубок мира, Кубок Наций, Чемпионат мира среди студентов, Чемпионат мира среди юношей.",
        "assets/images/rowing.PNG",
        "",
        0
      )
    );
    sports.push(
      new Sport(
        "Академическая гребля",
        "Академическая гребля — циклический вид спорта. Спортсмены находятся в лодках и гребут вёслами, используя мышцы спины, рук и ног, проходя дистанцию спиной вперёд, в отличие от гребли на байдарках и каноэ. Наиболее распространена и популярна в странах Западной Европы, России, США, Австралии, Новой Зеландии и Румынии." +
          " Файл:ROWING Women's Single Sculls Final - 28th Summer Universiade 2015 Gwangju.webm" +
          " Академическая гребля включена в программу Олимпийских игр c 1896 года (у женщин с 1976 года). Кроме Олимпийских игр ежегодно проводится Чемпионат мира, Кубок мира, Кубок Наций, Чемпионат мира среди студентов, Чемпионат мира среди юношей.",
        "assets/images/rowing.PNG",
        "",
        0
      )
    );
    sports.push(
      new Sport(
        "Академическая гребля",
        "Академическая гребля — циклический вид спорта. Спортсмены находятся в лодках и гребут вёслами, используя мышцы спины, рук и ног, проходя дистанцию спиной вперёд, в отличие от гребли на байдарках и каноэ. Наиболее распространена и популярна в странах Западной Европы, России, США, Австралии, Новой Зеландии и Румынии." +
          " Файл:ROWING Women's Single Sculls Final - 28th Summer Universiade 2015 Gwangju.webm" +
          " Академическая гребля включена в программу Олимпийских игр c 1896 года (у женщин с 1976 года). Кроме Олимпийских игр ежегодно проводится Чемпионат мира, Кубок мира, Кубок Наций, Чемпионат мира среди студентов, Чемпионат мира среди юношей.",
        "assets/images/rowing.PNG",
        "",
        0
      )
    );
    return sports;
  }
}
